tutorials/FF/dambreak/of-swe_supercritical/interFoam_solver_of-swe_supercritical/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant interFoam_solver_of-swe_supercritical;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              interFoam_solver_of-swe_supercritical-Mesh;
    patches           (rightwall_outlet);

    readData
    (

    );

    writeData
    (
    Alpha
    Velocity
    );
  };
};
